{
  "jobs": [
    {
      "id": 1993888,
      "url": "https://remotive.com/remote-jobs/all-others/network-administrator-1993888",
      "title": "Network Administrator",
      "company_name": "Inetum",
      "company_logo": "https://remotive.com/job/1993888/logo",
      "category": "All others",
      "tags": [
        "cisco"
      ],
      "job_type": "full_time",
      "publication_date": "2025-04-08T06:51:23",
      "candidate_required_location": "Romania",
      "salary": "",
      "description": "<br><br><div class=\"h3\">Company Description</div><p><strong>Our Mission Statement</strong></p><p>Digital and human resources at the center of the sustainable development of our society.</p><p>In a world of continuous transformation, accelerated by technological developments and societal challenges, it is necessary to adapt in an ongoing, agile way to meet the challenges of the future.</p><p><strong>About Inetum</strong></p><p>Inetum is a European leader in digital services. Inetum’s team of 28,000 consultants and specialists strive every day to make a digital impact for businesses, public sector entities and society. Inetum’s solutions aim at contributing to its clients’ performance and innovation as well as the common good.</p><p>Preset in 19 countries with a dense network of sites, Inetum partners with major software publishers to meet the challenges of digital transformation with proximity and flexibility. Driven by its ambition for growth and scale, Inetum generated sales of 2.5 billion euros in 2023.</p><p>For more information, visit: <a href=\"https://www.inetum.com/en\" rel=\"nofollow\">www.inetum.com</a>.</p><br><br><div class=\"h3\">Job Description</div><p>This role creates trust by consulting business for IT services and solutions in own region for own area functions and own business processes.</p><p>Maintain and improve business satisfaction and confidence in IT through effective, efficient and secure IT service delivery. Minimize the impact of service outages to avoid costs and penalties</p><p><strong>Responsibilities</strong></p><ul style=\"\"><li style=\"\">Manage, monitor and maintain network configuration at scale (approx. 1000 network devices)</li><li style=\"\">Investigate/troubleshooting and solve network configuration issues</li><li style=\"\">Manage wire and wireless networks</li><li style=\"\">Support end users in network issues mainly with VPN connection and traffic</li></ul><br><br><div class=\"h3\">Qualifications</div><ul style=\"\"><li style=\"\">Minimum 5 years of professional experience as Network Administrator</li><li style=\"\">Expert in Network Systems (CISCO) including Network Security</li><li style=\"\">Professional in Wireless Network, Local Network, Internet connectivity, Proxy (Z-Scaler), WAN connectivity (MPLS, Site-2-Site), Firewalls (Cisco)</li><li style=\"\">Professional in tools PRTG, SolarWinds, Wireshark, Radius etc.</li><li style=\"\">Professional in DHCP, DNS server’s configuration</li><li style=\"\">Professional in VPN solutions (CISCO and Palo Alto) on both sides (end-user and backend side)</li><li style=\"\">Professional in network architectures and topologies (SD WAN, WAN/LAN, HUB-SPOKE)</li><li style=\"\">Hands-on experience in management network devices at enterprise scale (min. 500 network devices like: routers, switches, access points, etc.)</li><li style=\"\">Good communication skills</li></ul><p><strong>Certification - Nice to have</strong></p><ul style=\"\"><li style=\"\">Cisco Certified Network Professional Enterprise/Security/Data Center (CCNP)</li><li style=\"\">Cisco Certified Internetworking Expert Enterprise Infrastructure/Enterprise Wireless/Data Center/Security (CCIE)</li></ul><br><br><div class=\"h3\">Additional Information</div><p><strong>Project based: 1 year</strong></p><p><strong>Working mode: Remote - Romania</strong></p><p><strong>Benefits:</strong></p><ul style=\"\"><li style=\"\">Full access to foreign language learning platform</li><li style=\"\">Personalized access to tech learning platforms</li><li style=\"\">Tailored workshops and trainings to sustain your growth</li><li style=\"\">Medical subscription</li><li style=\"\">Meal tickets</li><li style=\"\">Monthly budget to allocate on flexible benefit platform</li><li style=\"\">Access to 7 Card services</li><li style=\"\">Wellbeing activities and gatherings</li></ul><img src=\"https://remotive.com/job/track/1993888/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
      "id": 1992691,
      "url": "https://remotive.com/remote-jobs/qa/manual-qa-analyst-1992691",
      "title": "Manual QA Analyst",
      "company_name": "epay, a Euronet Worldwide Company",
      "company_logo": "https://remotive.com/job/1992691/logo",
      "category": "QA",
      "tags": [
        "documentation",
        "manual testing"
      ],
      "job_type": "full_time",
      "publication_date": "2025-04-08T06:51:18",
      "candidate_required_location": "El Salvador",
      "salary": "",
      "description": "<p>We are seeking a Quality Assurance Analyst with a strong background in manual testing to ensure the reliability and performance of our backend software.</p><p></p><p><strong>Responsibilities:</strong></p><ul style=\"\"> <li style=\"\">Manual Testing: Execute detailed manual testing on new and existing software applications to identify and document defects, inconsistencies, and areas for improvement.</li> <li style=\"\">Test Planning: Develop comprehensive test plans, test cases, and test scripts based on software requirements and technical specifications.</li> <li style=\"\">Bug Reporting: Document and track bugs and issues in Jira, providing detailed information to the development team for resolution. Verify fixes and perform regression testing as needed.</li> <li style=\"\">Collaboration: Use Microsoft Teams to communicate effectively with developers, product managers, and other stakeholders to understand requirements and ensure alignment with quality standards.</li> <li style=\"\">· Data Review: Utilize Excel to review and analyze large datasets for backend testing. Apply advanced spreadsheet functions and understand data relationships to perform effective data manipulation during testing.</li> <li style=\"\">Documentation: Maintain thorough and accurate documentation of test cases, test results, and defect reports in Jira.</li> <li style=\"\">Time Management: Manage time efficiently to meet deadlines and deliver high-quality results within project timelines.</li> <li style=\"\">Feedback: Provide critical feedback to stakeholders, including clients, project managers, and developers, regarding software quality and areas for improvement.</li> </ul><p><strong>Requirements</strong></p><p>Experience: 3-5 years of experience in manual software testing. Experience with automated testing a plus.</p><p>Proficiency in creating detailed test cases and scenarios, strong analytical skills, and attention to detail.</p><p>Knowledge: Understanding software development life cycle (SDLC) and testing methodologies (e.g., functional, integration, regression)</p><p>Advanced English Level.</p><p><strong>Benefits</strong></p><ul style=\"\"> <li style=\"\">Life Insurance</li> <li style=\"\">50/50 Health insurance.</li> <li style=\"\">Internal savings and Credits Association</li> <li style=\"\">Tuition program</li> </ul><br><br><div class=\"h2\">About the company</div><br><p>epay, a segment of Euronet, Inc. (NASDAQ:EEFT), is a leading global provider of payment processing and prepaid solutions. The company has built an extensive network of retailer touchpoints and point-of-sale terminals in 63 countries that connects brands with consumers all over the world. The company offers a diverse ecosystem of services, products and solutions supporting the distribution of Payment and Branded Payments for more than 1,000 brand partners via Commerce, eCommerce and mCommerce solutions.</p><img src=\"https://remotive.com/job/track/1992691/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
      "id": 1992200,
      "url": "https://remotive.com/remote-jobs/product/product-manager-1992200",
      "title": "Product Manager",
      "company_name": "Encompass Technologies",
      "company_logo": "https://remotive.com/job/1992200/logo",
      "category": "Product",
      "tags": [
        "product management"
      ],
      "job_type": "full_time",
      "publication_date": "2025-04-08T06:51:07",
      "candidate_required_location": "Australia",
      "salary": "competitive salary, superannuation and bonus",
      "description": "<div class='\"content-intro\"'><p>From maker to market, Encompass is revolutionizing how technology supports the modern beverage industry–from winemaking with our vintrace solution to beverage production and distribution with our Encompass solutions, we are unlocking new levels of growth and efficiency for our customers across the entire three-tier beverage supply chain.  Join our team of technology &amp; beverage professionals as we drive innovation and modernization in one of the world’s oldest, and most passionate industries.</p></div><div class=\"h3\"><strong>Your Impact at Encompass</strong></div>\n<p>Encompass is seeking a motivated and knowledgeable <strong>Product Manager</strong> to lead our cross-functional product teams for <strong>vintrace, our industry-leading wine production software</strong> designed for future-forward producers.  You will take ownership of specific solutions within our portfolio, driving product strategy, development, and performance. This role requires excellent time management and prioritization skills to balance competing demands effectively.</p>\n<p>The ideal candidate will be passionate about product performance and customer engagement. You will collaborate with development teams to create innovative solutions, ensuring timely product releases, customer satisfaction, and alignment with market trends. Additionally, you will represent your product in customer meetings, industry events, and webinars.</p>\n<div class=\"h3\"><strong>What You’ll Do:</strong></div>\n<div class=\"h4\"><strong>Product Planning &amp; Implementation:</strong></div>\n<ul style=\"\">\n<li style=\"\">Maintain a 3-6 month product roadmap aligned with business and customer needs.</li>\n<li style=\"\">Collaborate with clients and internal teams to prioritize features and bug fixes.</li>\n<li style=\"\">Work closely with development teams to refine deliverables and manage feature rollouts.</li>\n<li style=\"\">Drive customer adoption through effective training, documentation, and release demos.</li>\n<li style=\"\">Conduct market research to stay ahead of industry trends and competing solutions.</li>\n</ul>\n<div class=\"h4\"><strong>Cross-functional Collaboration &amp; Leadership:</strong></div>\n<ul style=\"\">\n<li style=\"\">Provide coaching and mentorship to team members.</li>\n<li style=\"\">Support recruitment and performance management processes.</li>\n<li style=\"\">Lead customer training sessions and provide educational materials.</li>\n<li style=\"\">Assist Sales and Customer Support teams with complex product conversations.</li>\n</ul>\n<div class=\"h3\"><strong>What You'll Bring to Encompass:</strong></div>\n<div class=\"h4\"><strong>Preferred Qualifications &amp; Experience:</strong></div>\n<ul style=\"\">\n<li style=\"\">Strong <strong>written and verbal communication</strong> skills.</li>\n<li style=\"\">Ability to <strong>independently prioritize</strong> tasks and lead initiatives.</li>\n<li style=\"\">Strong problem-solving skills with the ability to <strong>break down complex issues</strong> and define actionable next steps.</li>\n<li style=\"\">Experience with <strong>Scrum frameworks</strong> (certification preferred) and a proven track record in product management.</li>\n<li style=\"\">A keen eye for <strong>user experience and design</strong>.</li>\n<li style=\"\">Experience leading <strong>cross-functional teams</strong> across multiple time zones.</li>\n<li style=\"\">A <strong>continuous improvement mindset</strong>, always looking for opportunities to enhance efficiency.</li>\n<li style=\"\">Strong <strong>digital and analytical skills</strong>.</li>\n</ul>\n<div class=\"h3\"><strong>Education &amp; Certifications:</strong></div>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree in <strong>Business, Computer Science</strong>, or equivalent <strong>Product/Project management experience</strong>.</li>\n<li style=\"\">5+ years of product management experience preferably in an enterprise software environment.</li>\n<li style=\"\">Experience with wine production software and/or wine industry experience is a plus.</li>\n</ul>\n<div class=\"h3\"><strong>Additional Details</strong></div>\n<p><strong>Salary: </strong>This role will receive a competitive salary, superannuation and bonus. </p>\n<p><strong>Location: </strong>We are a remote-first organization and are open to applicants for both hybrid and fully remote roles.  Our AU corporate office is located in Melbourne, AU. </p>\n<div class=\"h3\"><strong>Benefits and Perks</strong></div>\n<p>With teams based across the globe, no matter where you work Encompass' competitive benefits and perks are designed to enhance your life including:</p>\n<ul style=\"\">\n<li style=\"\">Remote-first organization</li>\n<li style=\"\">Inclusive Parental Leave program</li>\n<li style=\"\">Paid Leave Program </li>\n<li style=\"\">Health and wellness stipend </li>\n<li style=\"\">Generous learning stipend</li>\n<li style=\"\">Technology stipend </li>\n<li style=\"\">Paid time fitness </li>\n<li style=\"\">Employee assistance program</li>\n<li style=\"\">Additional gifted leave days</li>\n</ul><div class='\"content-conclusion\"'><div class=\"h4\"><strong>Our Values</strong><strong> </strong></div>\n<p>Our values shape the way we work together and serve our customers.  They provide insight into our goals of disrupting the industry, figuring out better solutions, and doing so as part of a fast-paced, cohesive, fun-loving, and supportive team. </p>\n<ul style=\"\">\n<li style=\"\"><strong>Do the Right Thing </strong></li>\n<li style=\"\"><strong>Win Together</strong></li>\n<li style=\"\"><strong>Iterate &amp; Learn</strong></li>\n<li style=\"\"><strong>Own It</strong></li>\n<li style=\"\"><strong>Be You</strong></li>\n</ul>\n<div class=\"h4\"><strong>BeYou@Encompass</strong></div>\n<p><em>At Encompass, we aim for all of our employees to feel engaged, valued, and free to be who they are at work. We celebrate multiple approaches and points of view. We are committed to growing and empowering a diverse and inclusive community and believe that a team that works together with diverse lived experiences will strengthen our organization.  </em></p>\n<p><em>We are proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, sexual orientation, gender identity or expression, religion, national origin, marital status, age, disability, veteran status, genetic information, or any other protected status.</em><strong><em> </em></strong></p></div><img src=\"https://remotive.com/job/track/1992200/blank.gif?source=public_api\" alt=\"\"/>"
    }
  ]
}