{
  "jobs": [
    {
      "id": 1993888,
      "url": "https://remotive.com/remote-jobs/all-others/network-administrator-1993888",
      "title": "Network Administrator",
      "company_name": "Inetum",
      "company_logo": "https://remotive.com/job/1993888/logo",
      "category": "All others",
      "tags": [
        "cisco"
      ],
      "job_type": "full_time",
      "publication_date": "2025-04-08T06:51:23",
      "candidate_required_location": "Romania",
      "salary": "",
      "description": "<br><br><div class=\"h3\">Company Description</div><p><strong>Our Mission Statement</strong></p><p>Digital and human resources at the center of the sustainable development of our society.</p><p>In a world of continuous transformation, accelerated by technological developments and societal challenges, it is necessary to adapt in an ongoing, agile way to meet the challenges of the future.</p><p><strong>About Inetum</strong></p><p>Inetum is a European leader in digital services. Inetum’s team of 28,000 consultants and specialists strive every day to make a digital impact for businesses, public sector entities and society. Inetum’s solutions aim at contributing to its clients’ performance and innovation as well as the common good.</p><p>Preset in 19 countries with a dense network of sites, Inetum partners with major software publishers to meet the challenges of digital transformation with proximity and flexibility. Driven by its ambition for growth and scale, Inetum generated sales of 2.5 billion euros in 2023.</p><p>For more information, visit: <a href=\"https://www.inetum.com/en\" rel=\"nofollow\">www.inetum.com</a>.</p><br><br><div class=\"h3\">Job Description</div><p>This role creates trust by consulting business for IT services and solutions in own region for own area functions and own business processes.</p><p>Maintain and improve business satisfaction and confidence in IT through effective, efficient and secure IT service delivery. Minimize the impact of service outages to avoid costs and penalties</p><p><strong>Responsibilities</strong></p><ul style=\"\"><li style=\"\">Manage, monitor and maintain network configuration at scale (approx. 1000 network devices)</li><li style=\"\">Investigate/troubleshooting and solve network configuration issues</li><li style=\"\">Manage wire and wireless networks</li><li style=\"\">Support end users in network issues mainly with VPN connection and traffic</li></ul><br><br><div class=\"h3\">Qualifications</div><ul style=\"\"><li style=\"\">Minimum 5 years of professional experience as Network Administrator</li><li style=\"\">Expert in Network Systems (CISCO) including Network Security</li><li style=\"\">Professional in Wireless Network, Local Network, Internet connectivity, Proxy (Z-Scaler), WAN connectivity (MPLS, Site-2-Site), Firewalls (Cisco)</li><li style=\"\">Professional in tools PRTG, SolarWinds, Wireshark, Radius etc.</li><li style=\"\">Professional in DHCP, DNS server’s configuration</li><li style=\"\">Professional in VPN solutions (CISCO and Palo Alto) on both sides (end-user and backend side)</li><li style=\"\">Professional in network architectures and topologies (SD WAN, WAN/LAN, HUB-SPOKE)</li><li style=\"\">Hands-on experience in management network devices at enterprise scale (min. 500 network devices like: routers, switches, access points, etc.)</li><li style=\"\">Good communication skills</li></ul><p><strong>Certification - Nice to have</strong></p><ul style=\"\"><li style=\"\">Cisco Certified Network Professional Enterprise/Security/Data Center (CCNP)</li><li style=\"\">Cisco Certified Internetworking Expert Enterprise Infrastructure/Enterprise Wireless/Data Center/Security (CCIE)</li></ul><br><br><div class=\"h3\">Additional Information</div><p><strong>Project based: 1 year</strong></p><p><strong>Working mode: Remote - Romania</strong></p><p><strong>Benefits:</strong></p><ul style=\"\"><li style=\"\">Full access to foreign language learning platform</li><li style=\"\">Personalized access to tech learning platforms</li><li style=\"\">Tailored workshops and trainings to sustain your growth</li><li style=\"\">Medical subscription</li><li style=\"\">Meal tickets</li><li style=\"\">Monthly budget to allocate on flexible benefit platform</li><li style=\"\">Access to 7 Card services</li><li style=\"\">Wellbeing activities and gatherings</li></ul><img src=\"https://remotive.com/job/track/1993888/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
      "id": 1992691,
      "url": "https://remotive.com/remote-jobs/qa/manual-qa-analyst-1992691",
      "title": "Manual QA Analyst",
      "company_name": "epay, a Euronet Worldwide Company",
      "company_logo": "https://remotive.com/job/1992691/logo",
      "category": "QA",
      "tags": [
        "documentation",
        "manual testing"
      ],
      "job_type": "full_time",
      "publication_date": "2025-04-08T06:51:18",
      "candidate_required_location": "El Salvador",
      "salary": "",
      "description": "<p>We are seeking a Quality Assurance Analyst with a strong background in manual testing to ensure the reliability and performance of our backend software.</p><p></p><p><strong>Responsibilities:</strong></p><ul style=\"\"> <li style=\"\">Manual Testing: Execute detailed manual testing on new and existing software applications to identify and document defects, inconsistencies, and areas for improvement.</li> <li style=\"\">Test Planning: Develop comprehensive test plans, test cases, and test scripts based on software requirements and technical specifications.</li> <li style=\"\">Bug Reporting: Document and track bugs and issues in Jira, providing detailed information to the development team for resolution. Verify fixes and perform regression testing as needed.</li> <li style=\"\">Collaboration: Use Microsoft Teams to communicate effectively with developers, product managers, and other stakeholders to understand requirements and ensure alignment with quality standards.</li> <li style=\"\">· Data Review: Utilize Excel to review and analyze large datasets for backend testing. Apply advanced spreadsheet functions and understand data relationships to perform effective data manipulation during testing.</li> <li style=\"\">Documentation: Maintain thorough and accurate documentation of test cases, test results, and defect reports in Jira.</li> <li style=\"\">Time Management: Manage time efficiently to meet deadlines and deliver high-quality results within project timelines.</li> <li style=\"\">Feedback: Provide critical feedback to stakeholders, including clients, project managers, and developers, regarding software quality and areas for improvement.</li> </ul><p><strong>Requirements</strong></p><p>Experience: 3-5 years of experience in manual software testing. Experience with automated testing a plus.</p><p>Proficiency in creating detailed test cases and scenarios, strong analytical skills, and attention to detail.</p><p>Knowledge: Understanding software development life cycle (SDLC) and testing methodologies (e.g., functional, integration, regression)</p><p>Advanced English Level.</p><p><strong>Benefits</strong></p><ul style=\"\"> <li style=\"\">Life Insurance</li> <li style=\"\">50/50 Health insurance.</li> <li style=\"\">Internal savings and Credits Association</li> <li style=\"\">Tuition program</li> </ul><br><br><div class=\"h2\">About the company</div><br><p>epay, a segment of Euronet, Inc. (NASDAQ:EEFT), is a leading global provider of payment processing and prepaid solutions. The company has built an extensive network of retailer touchpoints and point-of-sale terminals in 63 countries that connects brands with consumers all over the world. The company offers a diverse ecosystem of services, products and solutions supporting the distribution of Payment and Branded Payments for more than 1,000 brand partners via Commerce, eCommerce and mCommerce solutions.</p><img src=\"https://remotive.com/job/track/1992691/blank.gif?source=public_api\" alt=\"\"/>"
    }
  ]
}